# -*- coding: utf-8 -*-
"""
Created on Mon Apr 25 13:24:04 2022

@author: smpsm
"""

'''
연습문제 07)
The Age of AI  [https://www.youtube.com/watch?v=UwsrzCVZAb8]
와, 진짜… 신기하다. 공부하고, 알아갈수록 인공지능 이라고 하는 것에 대한 막연한 이미지에서, 구체화 된 이미지로 점점 자리잡아 가는 것 같다. 흔히 영화에서 보는 ‘인공지능’은 솔직히 강한 인공지능의 일종으로, 특정 분야에 국한 된 것이 아닌 사람을 넘어서는 엄청난 인공지능의 모습을 보여준다. 하지만 지금은 ‘약한인공지능’의 수준이긴 하다.

그럼에도 영상에서 인상 깊었던 것은, 사고로 팔이 없는 사람의 근육을 초음파로 감지해 어떤 손가락을 움직이게 할 것인가를 판단해 실제로 움직이도록 한다는 것이었다. 또한 실제 사람의 사진을 데이터 삼아 실제와 거의 유사한 모델을 만드는 것도 놀라웠다. 분명히 기술은 발전할 것이고, 분명 더 근접하게 발전할 것이다.

그러나 ‘특정 분야’에 대해서는 이렇게 빠르게 발전하고 있지만, 정말 사람 수준으로 복합적인 강한 인공지능까지 도달 하는데는 과연 얼마나 걸릴지 궁금하다.

'''